HW2/app/controllers/movies_controller.rb

  def index
    session[:ratings] ||= Hash[@all_ratings.map {|r| [r, 1]}]
    session[:order] ||= ''
    session[:ratings] = params[:ratings] if params[:ratings]
    session[:order] = params[:order] if params[:order]
    if !params[:order] || !params[:ratings]
      redirect_to movies_path(:ratings => session[:ratings], :order => session[:order])
      flash.keep
    end
    @ratings = session[:ratings].keys
    @order = session[:order]
    @movies = Movie.where({rating: @ratings}).order(params[:order])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title